Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A19B.tmx
Source language: en_us
Languages: zh_cn

source: Happy Niu Year
zh_cn: 牛年快乐

source: 2008 is now finally in the past as millions of Chinese people around the world welcomed the Chinese New Year on Monday 26 January.
zh_cn: 终于走过2008年了，全世界的数亿华人都在欢迎1月26日的星期一，中国新年的到来。

source: As we waved goodbye to the Year of the Rat, the Year of the Ox was greeted in traditional style with firecrackers, parties and feasts.
zh_cn: 就在我们挥手告别鼠年之际，大家以传统过年的方式，燃放烟花爆竹，举行全家聚会，准备除夕大餐来欢庆牛年的到来。

source: As the Chinese word for Ox is pronounced 'Niu' which sounds similar to 'new' in English, but has the meaning of being 'bullish', this pun is interpreted as an auspicious start to the year.
zh_cn: 对中国人来说，汉字的“牛”同英语单词里面的“NEW”发音非常相似。而且其本身又含有乐观，牛气之意，这个双关语被阐述引申为“开门红”。

source: According to Chinese astrology, people born in the Year of the Ox are patient, hardworking and can inspire confidence in others.
zh_cn: 根据中国的历法，在牛年出生的人有着非常坚韧耐心，勤勤恳恳而且能帮助别人提升自信。

source: However, they can be fierce and remarkably stubborn at times.
zh_cn: 然而同时，他们又脾气火暴，有时又十分倔强。

source: Traditionally in London, the Chinese New Year celebration is held on the first Sunday after New Year's Day.
zh_cn: 按照伦敦的惯例，庆祝中国新年的方式在节后第一个星期日里举行。

source: This year, the mayor of London has promised spectators a rich mixture of live performances, a colourful parade and culinary delights at the famous landmark Trafalgar Square.
zh_cn: 今年，伦敦市市长允诺承办一场内容宏大，节目丰富而且别开生面的表演，多姿多彩的街上游行以及在著名胜地特拉法尔加广场推出的烹饪佳肴。

source: Further up in Derry, in Northern Ireland, the celebration arrived early.
zh_cn: 在北爱尔兰的德里，对春节的庆祝早先一步上演。

source: Locals were treated to calligraphy demonstrations, authentic Chinese tea tasting and a Chinese banquet.
zh_cn: 当地人被邀请观看书法表演，中式品茶会以及中式宴会。

source: The mayor of Derry, Gerard Diver, thought the events were extremely important, not just for the Chinese community, but to everyone in Derry.
zh_cn: 德里市的市长杰勒德.笛沃认为华人庆祝活动极为重要，不仅仅是针对当地华人社区而论，更是对德里的所有人而言。

source: “We live on an island, and I sometimes think that we're perhaps not as exposed to different cultures or to different ways of doing things as we should be.
zh_cn: 笛沃先生说：“我们大家同是呆在一个岛屿上，我认为有时候，也许我们不属于不同的文化范畴或者是对于我们应该去做的事情抱有的不同方式。

source: This is a valuable opportunity to gain an insight into Chinese culture and traditions, and it's also an important sign of progress,” said Mr Diver. The global financial crisis has, however, affected celebrations elsewhere in the country.
zh_cn: 对于我们去了解中国的传统文化，这是个难得的好机遇，而且也是这一种进程中的重要一环。” 尽管各地都在搞庆祝活动，但是全球经济危机已影响到了这个国家各各角落。

source: Coventry Community Chinese Association was forced to cancel its plans for the New Year due to lack of funding.
zh_cn: 考文垂社区中国协会由于缺资金被勒令取消其为庆祝新年而举行的计划。

source: Similarly in the south west part of the country, decisions were made to scale down the celebration after a number of sponsors were forced to cut back on financial support.
zh_cn: 英国西部地区情况也很相近，在一群赞助商被下令削减财政支出后 （众人）决定"量财而出"举办庆祝活动。

source: Despite the setbacks, people are determined to welcome the Niu Year in style and hope the Year of the Ox will bring prosperity through fortitude and hard work.
zh_cn: 尽管有了挫折与麻烦，但是人们决心以自己的方式欢庆牛年的到来，而且希望牛年里通过坚韧不拔的毅力和辛勤工作的方式能带来繁荣昌盛的局面.
